       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEPOSIT.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LK-CURRENT-BALANCE          PIC S9(13)V99 COMP-3.
       01  LK-DEPOSIT-AMOUNT           PIC S9(13)V99 COMP-3.
       01  LK-NEW-BALANCE              PIC S9(13)V99 COMP-3.

       PROCEDURE DIVISION USING LK-CURRENT-BALANCE LK-DEPOSIT-AMOUNT
           LK-NEW-BALANCE.
           COMPUTE LK-NEW-BALANCE = LK-CURRENT-BALANCE +
               LK-DEPOSIT-AMOUNT
           GOBACK.
