       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEPOSIT.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LK-CURRENT-BALANCE          PIC S9(11)V9999.
       01  LK-DEPOSIT-AMOUNT           PIC S9(11)V9999.
       01  LK-NEW-BALANCE              PIC S9(11)V9999.

       PROCEDURE DIVISION.
           COMPUTE LK-NEW-BALANCE = LK-CURRENT-BALANCE +
               LK-DEPOSIT-AMOUNT
           GOBACK.
