       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-TEST.
       DATA DIVISION.
       LINKAGE SECTION.
      *20 ALPHANUMERIC CHARACTERS
       01  LK-DISPLAY PIC X(20).

       PROCEDURE DIVISION USING LK-DISPLAY.
           MOVE "Hi from COBOL!" TO LK-DISPLAY
           GOBACK.
