       IDENTIFICATION DIVISION.
       PROGRAM-ID. WITHDRAW.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LK-CURRENT-BALANCE          PIC S9(13)V99 COMP-3.
       01  LK-WITHDRAW-AMOUNT          PIC S9(13)V99 COMP-3.
       01  LK-NEW-BALANCE              PIC S9(13)V99 COMP-3.

       PROCEDURE DIVISION USING LK-CURRENT-BALANCE LK-WITHDRAW-AMOUNT
           LK-NEW-BALANCE.
           COMPUTE LK-NEW-BALANCE = LK-CURRENT-BALANCE -
               LK-WITHDRAW-AMOUNT
           GOBACK.
