       IDENTIFICATION DIVISION.
       PROGRAM-ID. FFI-HELLO.
       DATA DIVISION.
       LINKAGE SECTION.
       01  RESULT-BUFFER PIC X(200).

       PROCEDURE DIVISION USING RESULT-BUFFER.
       ENTRY "ffi_test" USING RESULT-BUFFER.
           STRING "Hello from COBOL!" DELIMITED BY SIZE
                    INTO RESULT-BUFFER
           END-STRING
           GOBACK.
